app/controllers/memberships_controller.rb

  def create
    user = User.find(params[:user_id])
    group = Group.find(params[:group_id])

    @membership = Membership.new(:user => user, :group => group)
    @membership.save!
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "groups" WHERE ("groups"."id" = 1)
INSERT INTO "memberships" ("created_at", "updated_at", "group_id", "user_id") VALUES('2010-01-23 01:47:47', '2010-01-23 01:47:47', 1, 1)

  def destroy
    @membership = Membership.find(params[:id])
    @membership.destroy
---
SELECT * FROM "memberships" WHERE ("memberships"."id" = 1)
DELETE FROM "memberships" WHERE "id" = 1